In [3]:
import numpy as np
import pandas as pd
import duckdb

def sqldf(query) :
    return duckdb.sql(query).df()

In [4]:
#1. Create the dataframe
data = {
 'EmployeeID': [101, 102, 103, 104, 105, 106, 107],
 'LastName': ['Smith', 'Johnson', 'Williams', 'Brown', 'Jones', 'Garcia', 'Miller'],
 'Department': ['Sales', 'IT', 'Marketing', 'Sales', 'HR', None, 'IT'],
 'Salary': [65000.00, 95000.00, 55000.00, 72000.00, 80000.00, 48000.00, 110000.00],
 'HireDate': ['2023-01-15', '2024-06-01', '2023-08-20', '2023-10-10', '2024-03-05', '2022-11-22', '2025-01-01']
}

Employees = pd.DataFrame(data)

Employees

   EmployeeID  LastName Department    Salary    HireDate
0         101     Smith      Sales   65000.0  2023-01-15
1         102   Johnson         IT   95000.0  2024-06-01
2         103  Williams  Marketing   55000.0  2023-08-20
3         104     Brown      Sales   72000.0  2023-10-10
4         105     Jones         HR   80000.0  2024-03-05
5         106    Garcia       None   48000.0  2022-11-22
6         107    Miller         IT  110000.0  2025-01-01

In [7]:
#Define a simple SQL query

sql_query = """SELECT * FROM Employees;"""

In [8]:
result_df = sqldf(sql_query)

print(result_df)

   EmployeeID  LastName Department    Salary    HireDate
0         101     Smith      Sales   65000.0  2023-01-15
1         102   Johnson         IT   95000.0  2024-06-01
2         103  Williams  Marketing   55000.0  2023-08-20
3         104     Brown      Sales   72000.0  2023-10-10
4         105     Jones         HR   80000.0  2024-03-05
5         106    Garcia       None   48000.0  2022-11-22
6         107    Miller         IT  110000.0  2025-01-01

In [9]:
sql_query = """SELECT EmployeeID,Salary
FROM Employees;"""

In [11]:
result_df = sqldf(sql_query)
print(result_df)

   EmployeeID    Salary
0         101   65000.0
1         102   95000.0
2         103   55000.0
3         104   72000.0
4         105   80000.0
5         106   48000.0
6         107  110000.0

In [12]:
sql_query = """SELECT * FROM Employees WHERE Department = 'Sales';"""

In [13]:
result_df = sqldf(sql_query)
print(result_df)

   EmployeeID LastName Department   Salary    HireDate
0         101    Smith      Sales  65000.0  2023-01-15
1         104    Brown      Sales  72000.0  2023-10-10

In [14]:
#Find all the employees in the IT dept with a salary greater than 100,000

sql_query = """SELECT * FROM Employees WHERE Department = 'IT' AND Salary > 100000.00;"""

In [15]:
result_df = sqldf(sql_query)
print(result_df)

   EmployeeID LastName Department    Salary    HireDate
0         107   Miller         IT  110000.0  2025-01-01

In [22]:
#filter all the employees in HR department OR joined after '2024-01-01'
sql_query = """SELECT * FROM Employees WHERE Department = 'HR' OR HireDate = '2024-01-01';"""

In [23]:
result_df = sqldf(sql_query)
print(result_df)

   EmployeeID LastName Department   Salary    HireDate
0         105    Jones         HR  80000.0  2024-03-05

In [24]:
# Filter employees where dept is not engineering
sql_query = """SELECT * FROM Employees WHERE NOT Department = 'IT';"""

In [25]:
result_df = sqldf(sql_query)
print(sql_query)

SELECT * FROM Employees WHERE NOT Department = 'IT';

# Filtering with special operators

In [21]:
#find employees whose salary is between 50000 and 75000

sql_query = """SELECT * FROM Employees WHERE Salary BETWEEN 50000 AND 75000;"""
result_df = sqldf(sql_query)
print(result_df)

   EmployeeID  LastName Department   Salary    HireDate
0         101     Smith      Sales  65000.0  2023-01-15
1         103  Williams  Marketing  55000.0  2023-08-20
2         104     Brown      Sales  72000.0  2023-10-10

In [31]:

sql_query = """SELECT * FROM Employees WHERE Department IN ('IT','Sales','HR');"""
result_df = sqldf(sql_query)
print(result_df)

   EmployeeID LastName Department    Salary    HireDate
0         101    Smith      Sales   65000.0  2023-01-15
1         102  Johnson         IT   95000.0  2024-06-01
2         104    Brown      Sales   72000.0  2023-10-10
3         105    Jones         HR   80000.0  2024-03-05
4         107   Miller         IT  110000.0  2025-01-01

# Pattern matching (LIKE)

In [ ]:
sql_query = """"""